"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить 
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь: 
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат 
  работы функции в переменную
* Вывести содержимое переменной на экран

"""
age = input("Введите свой возраст: ")

age = int(age)

def main(age):
    if age <= 6:
        return f"Пользователь должен учиться в детском саду {age}"
    elif age <= 18:
        return f"Подьзователь должен учиться в школе {age}"
    elif age <= 25:
        return f"Подьзователь должен учиться в ВУЗе  {age}"
    else:
        return f"Подьзователь должен работать{age}"

result = main(age)

print(result)
