"""

Домашнее задание №1

Условный оператор: Сравнение строк

* Написать функцию, которая принимает на вход две строки
* Проверить, является ли то, что передано функции, строками. 
  Если нет - вернуть 0
* Если строки одинаковые, вернуть 1
* Если строки разные и первая длиннее, вернуть 2
* Если строки разные и вторая строка 'learn', возвращает 3
* Вызвать функцию несколько раз, передавая ей разные праметры 
  и выводя на экран результаты

"""
ab = input('напиши  че нидь :')
ba = input('лан давай еще че нидь :')

def main(a , b):
  if isinstance(a, str) and isinstance(b, str):
    a = a.lower()
    b = b.lower()
    if a == b :
      return '1'
    elif a != b and len(a) > len(b):
      return '2'
    elif a != b and b == 'learn':
      return '3'
  else:
    return '0'

result = main(ab , ba)
print(result)

